## [penxle](https://penxle.app.spacelift.io/stack/penxle/run/01H7YAEZFJQFABAFGMXK8PA8D5) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H7XXW93EGDM5MNK9VZVG0N75] Planning changes with 0 custom hooks...
module.cloudflare.cloudflare_account.this: Refreshing state... [id=ada355841e173023d4ac3b5a9ba71669]
module.aws.random_password.rds: Refreshing state... [id=none]
module.vercel.vercel_project.penxle: Refreshing state... [id=prj_n4LtssucyREpzFyvM3d74bAQYXwd]
module.vercel.vercel_dns_record.penxle_dev_txt_google_site_verification: Refreshing state... [id=rec_c94f4b2d7390bbb37c625e89]
module.vercel.vercel_project.help: Refreshing state... [id=prj_MjgvzdDGpwd1sFfSvBftqgak6zfr]
module.vercel.vercel_project.landing: Refreshing state... [id=prj_nxatXit01vJmIZyZ5j7jaKutwft3]
module.vercel.vercel_project.company: Refreshing state... [id=prj_bVMIEINABh7RicwMzBMXBQadCFtz]
module.vercel.vercel_project_domain.penxle_com: Refreshing state... [id=penxle.com]
module.cloudflare.cloudflare_zone.penxle_com: Refreshing state... [id=78d0f6748950340099543c05ef149114]
module.cloudflare.cloudflare_zone.pnxl_co: Refreshing state... [id=7dbbc206e18ef79995ed2d20afa804e3]
module.cloudflare.cloudflare_zone.pnxl_cc: Refreshing state... [id=eba2ac0c455f1082d523fbd5865fe410]
module.cloudflare.cloudflare_zone.pnxl_net: Refreshing state... [id=c0b3042da9c0b436843b56eb3b89c684]
module.cloudflare.cloudflare_zone.penxle_io: Refreshing state... [id=d10093a0fffaed4ff2f64d0599c8f91a]
module.vercel.vercel_project_domain.staging_penxle_com: Refreshing state... [id=staging.penxle.com]
module.cloudflare.cloudflare_record._1bc0e453acb801a0a2abdb3160aa1f4a_pnxl_co: Refreshing state... [id=201130fb52ccafcf671abbea0715db80]
module.cloudflare.cloudflare_record.media_pnxl_co: Refreshing state... [id=a478acff86af9f8a9a58de04e9182b2d]
module.cloudflare.cloudflare_turnstile_widget.turnstile: Refreshing state... [id=0x4AAAAAAAIzqVNPSBt8QEAw]
module.cloudflare.cloudflare_record.mail_penxle_com_mx_10: Refreshing state... [id=48e471380ae0594031db04b21a362702]
module.cloudflare.cloudflare_record.akxggupt5k5bodiac7u5yb5tnigdyzff_domainkey_penxle_com: Refreshing state... [id=6c892af78c70a8cd96108ce312096fb5]
module.cloudflare.cloudflare_ruleset.penxle_com_dynamic_redirect: Refreshing state... [id=b2d81231ff6b41fda9aab6ba2ffc7ace]
module.cloudflare.cloudflare_record.www_penxle_com: Refreshing state... [id=6c9cc1e70ff2ef1c85e20af412b07611]
module.cloudflare.cloudflare_record.mail_penxle_com_txt_spf: Refreshing state... [id=0cd7b804aa1e2f52c382c90459c4dcef]
module.cloudflare.cloudflare_record.help_penxle_com: Refreshing state... [id=98a6d2b4d605bfea8e3eb24fad68e657]
module.cloudflare.cloudflare_record.idea_penxle_com: Refreshing state... [id=5bc63c291c54fc91dde90941d8b8c3af]
module.cloudflare.cloudflare_record.penxle_com: Refreshing state... [id=1265337a2bc659b49cdbc289d5bbf957]
module.cloudflare.cloudflare_record.penxle_com_txt_google_site_verification: Refreshing state... [id=14c242427949c9110576cd3496e93c9a]
module.cloudflare.cloudflare_record.ep5ll2uqfx5n4ayiess25l3pn4j7ayum_domainkey_penxle_com: Refreshing state... [id=f000bf8f82518ca434238b5dc325a597]
module.cloudflare.cloudflare_record.ntl3we67sato5l5rrsmw6gnm5ivmqydy_domainkey_penxle_com: Refreshing state... [id=d8112b82a9a51143eeb5e0a183ad7a0c]
module.cloudflare.cloudflare_record.status_penxle_com: Refreshing state... [id=35d98ad65c6058e30a50dd4fee05d535]
module.cloudflare.cloudflare_record.staging_penxle_com: Refreshing state... [id=01ff3f930f626a2b9f3738c98a5112f3]
module.cloudflare.cloudflare_ruleset.pnxl_cc_dynamic_redirect: Refreshing state... [id=26c99e807a11480ab64b801a8e0e3c38]
module.cloudflare.cloudflare_record.pnxl_cc: Refreshing state... [id=591ad9e9939bae567ef8ae4858685bd8]
module.cloudflare.cloudflare_record.www_penxle_io: Refreshing state... [id=e6228dde4ddfdcc290269e6ac6dce118]
module.cloudflare.cloudflare_ruleset.penxle_io_dynamic_redirect: Refreshing state... [id=0ce76425120446b4b1b2b8554a3c30a9]
module.cloudflare.cloudflare_record.penxle_io_txt_spf1: Refreshing state... [id=f13cdacb16275d807e513a094d509c8a]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_5_1: Refreshing state... [id=7e662ac6bb44cd12fa98ee121e2df38c]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_10_1: Refreshing state... [id=2c760d82471b65062b7af1ab5d6e2c6e]
module.cloudflare.cloudflare_record.penxle_io: Refreshing state... [id=26c2ad26730154d219ac9641d40b7d23]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_10_2: Refreshing state... [id=45aeedf054c3cb24539829e4d4d79c52]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_5_2: Refreshing state... [id=985b6c33e3ead8abd7427a15549cd228]
module.cloudflare.cloudflare_record.mail_penxle_io_mx_1: Refreshing state... [id=ce5ff054439f36ac74463091acbcab83]
module.cloudflare.cloudflare_record.mail_penxle_io: Refreshing state... [id=2f768d1b46e0a8ebd36cded7ca5d46b3]
module.cloudflare.cloudflare_record.pnxl_net: Refreshing state... [id=75daf6912c044229507402014cb6649b]
module.aws.data.aws_rds_engine_version.latest: Reading...
module.aws.aws_eip.nat_private_az1: Refreshing state... [id=eipalloc-061c04af4f98f7e65]
module.aws.aws_vpc.penxle: Refreshing state... [id=vpc-0579c94f99e93ed11]
module.aws.aws_eip.nat_private_az2: Refreshing state... [id=eipalloc-07cdd4e76b303ca2c]
module.aws.data.aws_rds_engine_version.latest: Read complete after 1s [id=15.3]
module.cloudflare.cloudflare_zone_dnssec.each["penxle.io"]: Refreshing state... [id=d10093a0fffaed4ff2f64d0599c8f91a]
module.cloudflare.cloudflare_zone_dnssec.each["pnxl.co"]: Refreshing state... [id=7dbbc206e18ef79995ed2d20afa804e3]
module.cloudflare.cloudflare_zone_dnssec.each["pnxl.cc"]: Refreshing state... [id=eba2ac0c455f1082d523fbd5865fe410]
module.cloudflare.cloudflare_zone_dnssec.each["pnxl.net"]: Refreshing state... [id=c0b3042da9c0b436843b56eb3b89c684]
module.cloudflare.cloudflare_zone_dnssec.each["penxle.com"]: Refreshing state... [id=78d0f6748950340099543c05ef149114]
module.cloudflare.cloudflare_zone_settings_override.each["penxle.com"]: Refreshing state... [id=78d0f6748950340099543c05ef149114]
module.cloudflare.cloudflare_zone_settings_override.each["penxle.io"]: Refreshing state... [id=d10093a0fffaed4ff2f64d0599c8f91a]
module.cloudflare.cloudflare_zone_settings_override.each["pnxl.cc"]: Refreshing state... [id=eba2ac0c455f1082d523fbd5865fe410]
module.cloudflare.cloudflare_zone_settings_override.each["pnxl.co"]: Refreshing state... [id=7dbbc206e18ef79995ed2d20afa804e3]
module.cloudflare.cloudflare_zone_settings_override.each["pnxl.net"]: Refreshing state... [id=c0b3042da9c0b436843b56eb3b89c684]
module.aws.aws_default_security_group.default: Refreshing state... [id=sg-067a56de8c85dad16]
module.aws.aws_default_route_table.default: Refreshing state... [id=rtb-0950b6daf3b08fb39]
module.aws.aws_subnet.public_az1: Refreshing state... [id=subnet-0c0f1c2302a02567e]
module.aws.aws_subnet.private_az1: Refreshing state... [id=subnet-024dd73d6018d2e39]
module.aws.aws_subnet.private_az2: Refreshing state... [id=subnet-09d82bf9e1fb6bdb6]
module.aws.aws_security_group.public: Refreshing state... [id=sg-0c563bbb691ee581d]
module.aws.aws_subnet.public_az2: Refreshing state... [id=subnet-064f753d822401555]
module.aws.aws_internet_gateway.public: Refreshing state... [id=igw-02841768b0d5df0b5]
module.aws.aws_nat_gateway.private_az1: Refreshing state... [id=nat-006cfa6af4c86382c]
module.aws.aws_route_table.public: Refreshing state... [id=rtb-0037c56d3641675e1]
module.aws.aws_db_subnet_group.public: Refreshing state... [id=public]
module.aws.aws_nat_gateway.private_az2: Refreshing state... [id=nat-07e8421386570bb87]
module.aws.aws_route_table_association.public_az2: Refreshing state... [id=rtbassoc-0081fb74a60935325]
module.aws.aws_route_table_association.public_az1: Refreshing state... [id=rtbassoc-08f5a0d346f0fe7d1]
module.aws.aws_route_table.private_az2: Refreshing state... [id=rtb-01b105ec2c8d116f5]
module.aws.aws_route_table.private_az1: Refreshing state... [id=rtb-0da3d8c6e5be8a332]
module.aws.aws_rds_cluster.penxle: Refreshing state... [id=penxle]
module.aws.aws_route_table_association.private_az2: Refreshing state... [id=rtbassoc-0307ce566eb66f906]
module.aws.aws_route_table_association.private_az1: Refreshing state... [id=rtbassoc-0e1fd91757af53e10]
module.aws.aws_rds_cluster_instance.penxle[0]: Refreshing state... [id=penxle-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vercel.vercel_project.company will be updated in-place
  ~ resource "vercel_project" "company" {
      ~ git_repository                          = {
          ~ production_branch = "main" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        id                                      = "prj_bVMIEINABh7RicwMzBMXBQadCFtz"
        name                                    = "company"
      + protection_bypass_for_automation_secret = (known after apply)
      ~ root_directory                          = "sites/company.penxle.com" -> "sites/penxle.io"
      + serverless_function_region              = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_domain.help_penxle_com will be created
  + resource "vercel_project_domain" "help_penxle_com" {
      + domain     = "help.penxle.com"
      + id         = (known after apply)
      + project_id = "prj_MjgvzdDGpwd1sFfSvBftqgak6zfr"
      + team_id    = (known after apply)
    }

  # module.vercel.vercel_project_domain.penxle_io will be created
  + resource "vercel_project_domain" "penxle_io" {
      + domain     = "penxle.io"
      + id         = (known after apply)
      + project_id = "prj_bVMIEINABh7RicwMzBMXBQadCFtz"
      + team_id    = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

[01H7XXW93EGDM5MNK9VZVG0N75] Changes are GO
[01H7XXW93EGDM5MNK9VZVG0N75] Uploading the list of managed resources...
[01H7XXW93EGDM5MNK9VZVG0N75] Generating Infracost JSON report from plan
time="2023-08-16T04:44:20Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"
time="2023-08-16T04:44:20Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"

[01H7XXW93EGDM5MNK9VZVG0N75] Infracost report generated successfully
[01H7XXW93EGDM5MNK9VZVG0N75] Mapping Infracost data to Terraform resources
[01H7XXW93EGDM5MNK9VZVG0N75] Costs mapped successfully
[01H7XXW93EGDM5MNK9VZVG0N75] Please be aware that Run changes calculation includes Terraform output changes.
[01H7XXW93EGDM5MNK9VZVG0N75] Resource list upload is GO
[01H7XXW93EGDM5MNK9VZVG0N75] Generating JSON representation of the plan...
[01H7XXW93EGDM5MNK9VZVG0N75] JSON representation is GO
[01H7XXW93EGDM5MNK9VZVG0N75] Generating Infracost JSON report from plan
time="2023-08-16T04:44:33Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"
time="2023-08-16T04:44:33Z" level=warning msg="No products found for module.aws.aws_rds_cluster_instance.penxle[0] Database instance (on-demand, db.serverless), using 0.00"

[01H7XXW93EGDM5MNK9VZVG0N75] Infracost report generated successfully
[01H7XXW93EGDM5MNK9VZVG0N75] Loading custom plan policy inputs...
[01H7XXW93EGDM5MNK9VZVG0N75] 0 custom plan policy inputs found
[01H7XXW93EGDM5MNK9VZVG0N75] No plan policies to evaluate
```

</details>